#ifndef CARSYSWINDOW_H
#define CARSYSWINDOW_H

#include <QMainWindow>
#include "logWindow/loginfunc.h"
#include "modbushandle.h"
#include "QProcess"
#include "QTimer"

namespace Ui {
class CarsysWindow;
}

class CarsysWindow : public QMainWindow
{
    Q_OBJECT

//================================================================================================================================
public:/*****************************************************公有***构造和析构函数***************************************************/
//================================================================================================================================
    explicit CarsysWindow(QWidget *parent = 0);
    ~CarsysWindow();

//================================================================================================================================
public:/*****************************************************公有***功能函数函数***************************************************/
//================================================================================================================================
      //获得用户数据
      void getUserInf(UserData infor);
      //串口是否正常连接检查
      void creatSerialCheck(int msec);
private slots:
      //串口检查槽函数
      void SerialCheck();

      void on_actionfull_screen_triggered();

      void on_actionout_full_screen_triggered();

private:
    Ui::CarsysWindow *ui;
    UserData userInf;				//用户数据
    bool Datalock;					//数据锁初始true,数据可继续发送，数据读取时false
    modbusHandle  moddb;			//提供modbus数据发送，数据接收处理等函数
    QProcess * myprocess;
    QTimer *timerSerial;					//计时器
    bool stop;					//设置停止位
};

#endif // CARSYSWINDOW_H

//================================================================================================================================
/*
 *函数名称:
 *函数功能:
 *函数参数:
 *函数返回值:
*/

//================================================================================================================================
//private slots:/********************************私有************动作按钮函数**********************************************************/
//================================================================================================================================
